In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

In [2]:
df =  pd.read_excel(r"C:\Users\Robyi\Documents\Latihan Minitab\salesdatavisualize.xlsx")

In [3]:
df.head()

,Date,Day,Month,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2011-01-01,1,January,2011,33,Young Adults (25-34),F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
1,2011-01-01,1,January,2011,23,Youth (<25),M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2,2011-01-01,1,January,2011,17,Youth (<25),M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
3,2011-01-01,1,January,2011,39,Adults (35-64),M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
4,2011-01-01,1,January,2011,42,Adults (35-64),M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [4]:
df['Date'] = df['Date'].sort_values()

In [5]:
df.drop(columns = ['Month','Day'], inplace = True)

In [6]:
tes1 = df['Date'].groupby(df['Date'])

In [7]:
print(tes1)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x0000015D0997FE30>

In [10]:
tes1.mean()

Date
2011-01-01   2011-01-01
2011-01-02   2011-01-02
2011-01-03   2011-01-03
2011-01-04   2011-01-04
2011-01-05   2011-01-05
                ...
2016-07-27   2016-07-27
2016-07-28   2016-07-28
2016-07-29   2016-07-29
2016-07-30   2016-07-30
2016-07-31   2016-07-31
Name: Date, Length: 1884, dtype: datetime64[ns]

In [9]:
tes1.max()

Date
2011-01-01   2011-01-01
2011-01-02   2011-01-02
2011-01-03   2011-01-03
2011-01-04   2011-01-04
2011-01-05   2011-01-05
                ...
2016-07-27   2016-07-27
2016-07-28   2016-07-28
2016-07-29   2016-07-29
2016-07-30   2016-07-30
2016-07-31   2016-07-31
Name: Date, Length: 1884, dtype: datetime64[ns]

In [21]:
tes2 = df['Product'].groupby([df['Profit'],df['Cost']])

In [23]:
tes3 = df['Customer_Age'].groupby(df['Age_Group'])

In [24]:
tes3.head()

0       33
1       23
2       17
3       39
4       42
5       41
6       40
7       35
8       32
12      29
13      28
17      28
26      19
34      18
45      17
83      72
277     65
615     66
1310    68
1566    65
Name: Customer_Age, dtype: int64

In [22]:
tes2.head()

0                   Road-150 Red, 48
1             Mountain-200 Black, 46
2                   Road-250 Red, 44
3              Road-550-W Yellow, 38
4                 Road-750 Black, 44
                     ...
111960                Road Tire Tube
112005           Hitch Rack - 4-Bike
112022         Half-Finger Gloves, M
112024           Hitch Rack - 4-Bike
112028    Long-Sleeve Logo Jersey, S
Name: Product, Length: 24324, dtype: object

In [26]:
tes3 = df['State'].groupby(df['Order_Quantity'])

In [29]:
tes3.head()

0                 Yveline
1                Victoria
2        British Columbia
3              Washington
4              California
               ...
60689          Queensland
60757     South Australia
60826          California
60911              Oregon
61273             Essonne
Name: State, Length: 160, dtype: object

In [33]:
tesdata1 = pd.DataFrame(tes3)

In [34]:
tesdata1.head()

   0                                                  1
0  1  1                 Victoria
2         British C...
1  2  0                  Yveline
16         South Au...
2  3  3               Washington
5               Que...
3  4  6                 Victoria
9               Cal...
4  5  7073                   Hessen
7075      Nordrh...

In [8]:
df.set_index(['Year','Date'], inplace = True)

In [9]:
df.head()

                 Customer_Age             Age_Group Customer_Gender  \
Year Date
2011 2011-01-01            33  Young Adults (25-34)               F
     2011-01-01            23           Youth (<25)               M
     2011-01-01            17           Youth (<25)               M
     2011-01-01            39        Adults (35-64)               M
     2011-01-01            42        Adults (35-64)               M

                       Country             State Product_Category  \
Year Date
2011 2011-01-01         France           Yveline            Bikes
     2011-01-01      Australia          Victoria            Bikes
     2011-01-01         Canada  British Columbia            Bikes
     2011-01-01  United States        Washington            Bikes
     2011-01-01  United States        California            Bikes

                   Sub_Category                 Product  Order_Quantity  \
Year Date
2011 2011-01-01      Road Bikes        Road-150 Red, 48               2
     2011-01-01  Mountain Bikes  Mountain-200 Black, 46               1
     2011-01-01      Road Bikes        Road-250 Red, 44               1
     2011-01-01      Road Bikes   Road-550-W Yellow, 38               3
     2011-01-01      Road Bikes      Road-750 Black, 44               1

                 Unit_Cost  Unit_Price  Profit  Cost  Revenue
Year Date
2011 2011-01-01       2171        3578    1097  4342     5439
     2011-01-01       1252        2295     561  1252     1813
     2011-01-01       1519        2443     900  1519     2419
     2011-01-01        713        1120     482  2139     2621
     2011-01-01        344         540     185   344      529

In [12]:
df.reset_index(inplace = True)

In [13]:
df.columns = df.columns.str.lower()

In [14]:
df.head()

,year,date,customer_age,age_group,customer_gender,country,state,product_category,sub_category,product,order_quantity,unit_cost,unit_price,profit,cost,revenue
0,2011,2011-01-01,33,Young Adults (25-34),F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
1,2011,2011-01-01,23,Youth (<25),M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2,2011,2011-01-01,17,Youth (<25),M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
3,2011,2011-01-01,39,Adults (35-64),M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
4,2011,2011-01-01,42,Adults (35-64),M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [15]:
df.unstack()

year     0         2011
         1         2011
         2         2011
         3         2011
         4         2011
                   ...
revenue  112031     484
         112032     377
         112033     144
         112034      64
         112035      35
Length: 1792576, dtype: object

In [ ]:
df.unstack().stack()

In [17]:
df.head()

,year,date,customer_age,age_group,customer_gender,country,state,product_category,sub_category,product,order_quantity,unit_cost,unit_price,profit,cost,revenue
0,2011,2011-01-01,33,Young Adults (25-34),F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
1,2011,2011-01-01,23,Youth (<25),M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2,2011,2011-01-01,17,Youth (<25),M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
3,2011,2011-01-01,39,Adults (35-64),M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
4,2011,2011-01-01,42,Adults (35-64),M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [19]:
df1 = pd.DataFrame({
    'Name': ['Nick','John','Chris','Nick'],
    'State':['NY','NJ','NJ','NY'],
    'Test_Score':[98,99,200,85]})

In [20]:
df1.head()

    Name State  Test_Score
0   Nick    NY          98
1   John    NJ          99
2  Chris    NJ         200
3   Nick    NY          85

In [21]:
df2 = pd.DataFrame({
    'Name': ['Nick','John','Chris','Nick'],
    'State':['NY','NJ','NJ','NY'],
    'Age':[21,22,21,21]})

In [22]:
df2.head()

    Name State  Age
0   Nick    NY   21
1   John    NJ   22
2  Chris    NJ   21
3   Nick    NY   21

In [24]:
df3 = pd.merge(df1, df2, on =['Name','State'])

In [25]:
df3.head()

    Name State  Test_Score  Age
0   Nick    NY          98   21
1   Nick    NY          98   21
2   John    NJ          99   22
3  Chris    NJ         200   21
4   Nick    NY          85   21

In [26]:
df4 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df5 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [4, 5, 6]})

In [27]:
df4

  key  value1
0   A       1
1   B       2
2   C       3

In [28]:
df5

  key  value2
0   B       4
1   C       5
2   D       6

In [31]:
df6 = pd.merge(df4, df5, on='key', how='inner')

In [32]:
df6

  key  value1  value2
0   B       2       4
1   C       3       5

In [34]:
df7 = pd.DataFrame({'value1': [1, 2, 3]}, index=['A', 'B', 'C'])
df8 = pd.DataFrame({'value2': [4, 5, 6]}, index=['B', 'C', 'D'])

In [35]:
df7

   value1
A       1
B       2
C       3

In [36]:
df8

   value2
B       4
C       5
D       6

In [38]:
df9 = df7.join(df8, how='inner')

In [39]:
df9

   value1  value2
B       2       4
C       3       5

In [40]:
df10 = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']})
df11 = pd.DataFrame({'A': ['A3', 'A4', 'A5'], 'B': ['B3', 'B4', 'B5']})

In [41]:
df10

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [42]:
df11

    A   B
0  A3  B3
1  A4  B4
2  A5  B5

In [43]:
df12 = pd.concat([df10, df11], axis=0)

In [44]:
df12

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [37]:
tes5 = df.groupby(['Product_Category','Sub_Category'])

In [38]:
tes6 = tes5['Profit']

In [39]:
tes6.agg("mean")

Product_Category  Sub_Category
Accessories       Bike Racks           514.282095
                  Bike Stands          442.243956
                  Bottles and Cages     51.113937
                  Cleaners              64.312431
                  Fenders              185.742560
                  Helmets              278.081975
                  Hydration Packs      429.286357
                  Tires and Tubes       80.649498
Bikes             Mountain Bikes       922.163013
                  Road Bikes           752.094269
                  Touring Bikes        616.991300
Clothing          Caps                  17.879991
                  Gloves               190.489203
                  Jerseys              100.472860
                  Shorts               576.556299
                  Socks                 83.040107
                  Vests                538.164938
Name: Profit, dtype: float64

In [40]:
tes7 = df.groupby(['Customer_Gender','Age_Group'])
tes8 = tes7['Order_Quantity']
tes8.agg("max")

Customer_Gender  Age_Group
F                Adults (35-64)          32
                 Seniors (64+)           31
                 Young Adults (25-34)    32
                 Youth (<25)             32
M                Adults (35-64)          32
                 Seniors (64+)           31
                 Young Adults (25-34)    32
                 Youth (<25)             32
Name: Order_Quantity, dtype: int64

In [45]:
tes9 = df.groupby(['Date','Country','State'])
tes10 = tes9[['Profit','Cost','Revenue']]
tes10.agg("mean").head()

                                           Profit    Cost  Revenue
Date       Country       State
2011-01-01 Australia     Victoria           561.0  1252.0   1813.0
           Canada        British Columbia   900.0  1519.0   2419.0
           France        Yveline           1097.0  4342.0   5439.0
           United States California         185.0   344.0    529.0
                         Washington         482.0  2139.0   2621.0

In [47]:
tes11 = df.groupby(['Product'])
tes12 = tes11['Unit_Cost']
tes12.agg("std")

Product
AWC Logo Cap                  0.0
All-Purpose Bike Stand        0.0
Bike Wash - Dissolver         0.0
Classic Vest, L               0.0
Classic Vest, M               0.0
                             ...
Touring-3000 Yellow, 62       0.0
Water Bottle - 30 oz.         0.0
Women's Mountain Shorts, L    0.0
Women's Mountain Shorts, M    0.0
Women's Mountain Shorts, S    0.0
Name: Unit_Cost, Length: 130, dtype: float64

In [55]:
tes12.transform("std")

0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
         ...
112031    0.0
112032    0.0
112033    0.0
112034    0.0
112035    0.0
Name: Unit_Cost, Length: 112036, dtype: float64

In [52]:
tes13 = df.groupby("Customer_Gender")['Revenue'].describe() 
tes13

,count,mean,std,min,25%,50%,75%,max
Customer_Gender,,,,,,,,
F,54223.0,768.948398,1305.956210,2.0,64.0,213.0,823.0,14169.0
M,57813.0,746.062010,1317.677303,2.0,64.0,238.0,792.0,58074.0

In [53]:
tes13.unstack("Customer_Gender")

       Customer_Gender
count  F                  54223.000000
       M                  57813.000000
mean   F                    768.948398
       M                    746.062010
std    F                   1305.956210
       M                   1317.677303
min    F                      2.000000
       M                      2.000000
25%    F                     64.000000
       M                     64.000000
50%    F                    213.000000
       M                    238.000000
75%    F                    823.000000
       M                    792.000000
max    F                  14169.000000
       M                  58074.000000
dtype: float64

In [54]:
df['Order_Quantity'].fillna(df['Order_Quantity'].mean())

0          2
1          1
2          1
3          3
4          1
          ..
112031    21
112032     7
112033     3
112034    19
112035     8
Name: Order_Quantity, Length: 112036, dtype: int64

In [56]:
df.head()

,Date,Year,Customer_Age,Age_Group,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2011-01-01,2011,33,Young Adults (25-34),F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
1,2011-01-01,2011,23,Youth (<25),M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2,2011-01-01,2011,17,Youth (<25),M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
3,2011-01-01,2011,39,Adults (35-64),M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
4,2011-01-01,2011,42,Adults (35-64),M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [60]:
df.drop(columns = ['Age_Group'], inplace = True)

In [62]:
df1 = df[['Year','Country','Cost','Profit','Order_Quantity']]

In [64]:
df1.pivot_table(index = ['Year','Country']).head()

                            Cost  Order_Quantity       Profit
Year Country
2011 Australia       2118.756410        1.988345   827.611888
     Canada          2154.600000        1.902222  1344.862222
     France          2872.321888        1.965665  1190.442060
     Germany         2416.802575        1.987124  1160.892704
     United Kingdom  1960.996226        2.030189  1146.479245

In [65]:
df2 = df[['Year','Country','Cost','Profit','Order_Quantity','Customer_Gender']]

In [67]:
df2.pivot_table(index = ['Year','Country'], columns = 'Customer_Gender', values = ['Profit','Cost']).head()

                            Cost                    Profit
Customer_Gender                F            M            F            M
Year Country
2011 Australia       2287.240535  1933.794621   901.403118   746.603912
     Canada          2149.903509  2159.423423  1325.614035  1364.630631
     France          2734.353982  3002.241667  1137.964602  1239.858333
     Germany         2619.015385  2161.582524  1274.807692  1017.116505
     United Kingdom  1980.120968  1944.177305  1155.927419  1138.170213

In [68]:
df2.pivot_table(index = ['Year','Country'], columns = 'Customer_Gender', values = ['Profit','Cost'], margins = True).head()

                            Cost                                 Profit  \
Customer_Gender                F            M          All            F
Year Country
2011 Australia       2287.240535  1933.794621  2118.756410   901.403118
     Canada          2149.903509  2159.423423  2154.600000  1325.614035
     France          2734.353982  3002.241667  2872.321888  1137.964602
     Germany         2619.015385  2161.582524  2416.802575  1274.807692
     United Kingdom  1980.120968  1944.177305  1960.996226  1155.927419


Customer_Gender                M          All
Year Country
2011 Australia        746.603912   827.611888
     Canada          1364.630631  1344.862222
     France          1239.858333  1190.442060
     Germany         1017.116505  1160.892704
     United Kingdom  1138.170213  1146.479245

In [69]:
df['Date'] = pd.to_datetime(df['Date'])

In [70]:
df.head()

,Date,Year,Customer_Age,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
0,2011-01-01,2011,33,F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
1,2011-01-01,2011,23,M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2,2011-01-01,2011,17,M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
3,2011-01-01,2011,39,M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
4,2011-01-01,2011,42,M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [71]:
df.set_index('Date', inplace = True)

In [72]:
df.head()

,Year,Customer_Age,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
Date,,,,,,,,,,,,,,
2011-01-01,2011,33,F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
2011-01-01,2011,23,M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2011-01-01,2011,17,M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
2011-01-01,2011,39,M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
2011-01-01,2011,42,M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529

In [74]:
df.truncate(after="2015-01-01")

,Year,Customer_Age,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
Date,,,,,,,,,,,,,,
2011-01-01,2011,33,F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
2011-01-01,2011,23,M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2011-01-01,2011,17,M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
2011-01-01,2011,39,M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
2011-01-01,2011,42,M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2015-01-01,2015,36,F,United States,California,Bikes,Mountain Bikes,"Mountain-200 Silver, 46",1,1266,2320,1008,1266,2274
2015-01-01,2015,29,M,United States,Oregon,Bikes,Road Bikes,"Road-650 Black, 44",1,487,783,186,487,673
2015-01-01,2015,19,F,United States,Washington,Bikes,Road Bikes,"Road-150 Red, 48",3,2171,3578,1860,6513,8373
2015-01-01,2015,42,M,Australia,Queensland,Bikes,Road Bikes,"Road-350-W Yellow, 48",1,1083,1701,346,1083,1429
2015-01-01,2015,29,F,United States,Florida,Bikes,Road Bikes,"Road-650 Red, 62",3,487,783,771,1461,2232

In [75]:
df.truncate(after="2012-01-01")

,Year,Customer_Age,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
Date,,,,,,,,,,,,,,
2011-01-01,2011,33,F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439
2011-01-01,2011,23,M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",1,1252,2295,561,1252,1813
2011-01-01,2011,17,M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",1,1519,2443,900,1519,2419
2011-01-01,2011,39,M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",3,713,1120,482,2139,2621
2011-01-01,2011,42,M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",1,344,540,185,344,529
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2012-01-01,2012,17,M,Canada,British Columbia,Bikes,Road Bikes,"Road-250 Red, 44",2,1519,2443,1799,3038,4837
2012-01-01,2012,42,M,United States,California,Bikes,Road Bikes,"Road-750 Black, 44",2,344,540,370,688,1058
2012-01-01,2012,39,M,United States,Washington,Bikes,Road Bikes,"Road-550-W Yellow, 38",2,713,1120,321,1426,1747
2012-01-01,2012,23,M,Australia,Victoria,Bikes,Mountain Bikes,"Mountain-200 Black, 46",2,1252,2295,1122,2504,3626
2012-01-01,2012,33,F,France,Yveline,Bikes,Road Bikes,"Road-150 Red, 48",2,2171,3578,1097,4342,5439

In [76]:
df["2015-01-01":"2015-12-30"]

,Year,Customer_Age,Customer_Gender,Country,State,Product_Category,Sub_Category,Product,Order_Quantity,Unit_Cost,Unit_Price,Profit,Cost,Revenue
Date,,,,,,,,,,,,,,
2015-01-01,2015,37,F,Germany,Hamburg,Bikes,Road Bikes,"Road-250 Black, 48",1,1555,2443,717,1555,2272
2015-01-01,2015,27,F,Australia,New South Wales,Bikes,Road Bikes,"Road-550-W Yellow, 48",1,713,1120,261,713,974
2015-01-01,2015,53,F,France,Seine (Paris),Bikes,Road Bikes,"Road-250 Black, 44",1,1555,2443,448,1555,2003
2015-01-01,2015,36,F,United States,California,Bikes,Mountain Bikes,"Mountain-200 Silver, 46",1,1266,2320,1008,1266,2274
2015-01-01,2015,29,M,United States,Oregon,Bikes,Road Bikes,"Road-650 Black, 44",1,487,783,186,487,673
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2015-12-30,2015,39,F,France,Seine (Paris),Clothing,Jerseys,"Long-Sleeve Logo Jersey, S",1,38,50,3,38,41
2015-12-30,2015,33,M,United States,Washington,Accessories,Tires and Tubes,LL Mountain Tire,26,9,25,273,234,507
2015-12-30,2015,31,M,Canada,British Columbia,Accessories,Fenders,Fender Set - Mountain,18,8,22,248,144,392
2015-12-30,2015,41,M,United Kingdom,England,Clothing,Jerseys,"Long-Sleeve Logo Jersey, M",21,38,50,210,798,1008
2015-12-30,2015,40,F,United States,Washington,Accessories,Tires and Tubes,Patch Kit/8 Patches,11,1,2,6,11,17

In [77]:
df.index.is_unique

False